{
  "architectures": [
    "RobertaForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "attention_probs_dropout_prog": 0.101197983,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu_new",
  "hidden_dropout_prob": 0.128818607,
  "hidden_size": 140,
  "initializer_range": 0.02,
  "intermediate_size": 198,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 1024,
  "model_type": "roberta",
  "num_attention_heads": 7,
  "num_hidden_layers": 3,
  "output_attentions": true,
  "output_hidden_states": true,
  "output_logits": true,
  "pad_token_id": 1,
  "position_embedding_type": "relative_key_query",
  "transformers_version": "4.3.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
